// Copyright 2025 Stephan Friedl. All rights reserved.
// Use of this source code is governed by a BSD-style
// license that can be found in the LICENSE file.

#pragma once

#include "minstdconfig.h"

#include "array"
#include "atomic"
#include "random"

#include "__concepts/derived_from.h"
#include "__type_traits/conditional.h"

#include "__extensions/hash_check.h"
#include "__extensions/memory_resource_statistics.h"
#include "__platform/cpu_platform_abstractions.h"
#include "lockfree/tagged_ptr"
#include "memory_resource.h"

#include "stdio.h"

namespace MINIMAL_STD_NAMESPACE
{
    namespace pmr
    {
        namespace internal
        {
            inline constexpr size_t lockfree_aligned_size(size_t unaligned_size_in_bytes, size_t alignment)
            {
                return (((unaligned_size_in_bytes / alignment) + ((unaligned_size_in_bytes % alignment) == 0 ? 0 : 1)) * alignment);
            }

            inline void *align_pointer(void *ptr, size_t alignment)
            {
                uintptr_t ptr_as_int = reinterpret_cast<uintptr_t>(ptr);

                uintptr_t alignment_mod = ptr_as_int % alignment;

                return (alignment_mod == 0) ? ptr : (void *)((ptr_as_int + alignment) - alignment_mod);
            }
        }

        //  This resource starts with a super-block of memory and then allocates blocks from that superblock.
        //      When the superblock is exhausted, a new superblock is allocated from the upstream resource.
        //      The blocks and allocations will be aligned on __max_align (should be 16 bytes) boundaries
        //      which should be optimal for modern processors.
        //
        //  On destruction, this resource will just dump all the memory it allocated without invoking any destructors

        template <typename... optional_extensions>
        class lockfree_single_block_resource : public memory_resource, public optional_extensions...
        {
        private:
            //  Internally, all blocks will be aligned on 64-byte boundaries.  This will support alignments
            //      of 2, 4, 8, 16, 32 and 64 bytes.  Generally 16 Bytes is optimal for modern processors.

            static constexpr size_t DEFAULT_ALIGNMENT = 64;

            struct alignas(DEFAULT_ALIGNMENT) block_header
            {
                size_t metadata_index_;
                size_t size_including_header_; //  size of the block including the block_header
                block_header *previous_block_;
                uint64_t hash_; //  hash of the header - we will use this to insure the heap has not been corrupted
            };

            static constexpr size_t ALLOCATION_HEADER_SIZE = sizeof(block_header);

            static_assert(ALLOCATION_HEADER_SIZE == 64, "allocation_header is not 64 bytes in size");

            struct alignas(64) block_metadata
            {
                // 8-byte aligned fields
                // Packed pointer + state + version: [ptr:48][state:8][version:8]
                // This allows atomic CAS to verify both pointer AND state simultaneously
                atomic<uint64_t> block_state_;                     // 0x00, 8B
                atomic<block_metadata *> next_;                    // 0x08, 8B
                uint64_t soft_deleted_at_counter_;                 // 0x10, 8B - monotonic counter value when soft-deleted
                uint64_t randomized_value_;                        // 0x18, 8B

                // 4-byte fields
                atomic<uint32_t> requested_size_;                  // 0x20, 4B
                uint32_t total_size_;                              // 0x24, 4B

                // Union for mutually exclusive list indices - metadata can only be on one list at a time:
                // - AVAILABLE state: on free block list (next_free_block_index_)
                // - SOFT_DELETED state: on soft-deleted list (next_soft_deleted_index_)
                // - METADATA_AVAILABLE state: on free metadata list (next_free_header_index_)
                union {                                            // 0x28, 4B
                    uint32_t next_free_block_index_;
                    uint32_t next_soft_deleted_index_;
                    uint32_t next_free_header_index_;
                };

                // 1-byte fields
                uint8_t alignment_;                                // 0x2C, 1B

                // Padding to 64 bytes (state_ removed - now packed in block_state_)
                uint8_t reserved_[19];                             // 0x2D, 19B

                /**
                 * @brief Computes a 64-bit hash value for the memory block.
                 *
                 * This function uses the FNV-1a hash algorithm to compute a 64-bit hash value
                 * for the memory block. The algorithm processes 24 bytes starting from next_,
                 * skipping block_state_ since it contains state and version fields that change.
                 *
                 * @return A 64-bit hash value representing the memory block.
                 */

                uint64_t hash()
                {
                    const uint8_t *data = reinterpret_cast<const uint8_t *>(&next_);
                    uint64_t hash_val = 0xcbf29ce484222325;
                    uint64_t prime = 0x100000001b3;

                    // Hash 24 bytes: next_(8B) + soft_deleted_at_counter_(8B) + randomized_value_(8B)
